app/controllers/api/servers_controller.rb

  def index
    @servers = Server.sortable
    response_success_api(@servers.map{|s| present(s).js_show })
---
SELECT "servers".* FROM "servers" ORDER BY sort_index, created_at

  def create
    @server = Server.create(params[:server])
---
INSERT INTO "servers" ("created_at", "name", "sort_index", "token", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 18 Mar 2012 17:12:08 UTC +00:00], ["name", "Test"], ["sort_index", 0], ["token", "ef6f6b11fbe918864c3fb76a78acb106"], ["updated_at", Sun, 18 Mar 2012 17:12:08 UTC +00:00]]

  def update
    @server = Server.find(params[:id])
    if @server.update_attributes(params[:server])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "37"]]
UPDATE "servers" SET "name" = 'Test 2.0', "updated_at" = '2012-03-20 12:53:47.359678' WHERE "servers"."id" = 37

  def destroy
    @server = Server.find(params[:id])
    if @server.destroy
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "36"]]
DELETE FROM "servers" WHERE "servers"."id" = ?  [["id", 36]]